app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 980190962  [["email", "sh@hotmail.com"], ["name", "hehe"], ["password_digest", "$2a$04$0UPXRhOnjG1FJB0Y80PoDuATHUYg1jqlnFRRiZYfpCyPX5cReY/uq"], ["updated_at", "2016-04-06 20:29:35.737230"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)