app/controllers/welcome_controller.rb

SELECT "buildings"."id", "buildings"."name" FROM "buildings"   ORDER BY "buildings"."name" ASC
SELECT "paths"."start", "paths"."end", "paths"."distance" FROM "paths"
SELECT "buildings".* FROM "buildings"  WHERE "buildings"."name" = 'golding'
SELECT  "nodes".* FROM "nodes"  WHERE "nodes"."id" = ? LIMIT 1  [["id", 1016]]
---
  def index
		#if @user.Home_Node
		map = CampusMap.new()
		@result = [[42.365965, -71.25981]]
    name_list = Building.order(:name).pluck(:id, :name)
		adjlist = Path.pluck(:start, :end, :distance)
		map.load_map(adjlist)
    @notes = {}
    name_list.sort_by{|id, name| name}.each do |id, name|
      @notes[name] = name
    end
		if params[:start] != nil && params[:end] != nil && params[:start] != '<option value=' && params[:end] != '<option value='
			@result = []
			start_id = (Building.where(name: params[:start]))[0].id.to_i
			end_id = (Building.where(name: params[:end]))[0].id.to_i
			paths = map.solve(start_id, end_id)
			paths.each do |id|
				node = Node.find(id)